HIPHelper/WebContent/SOAP/SOAPStoreDocTemplate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header
		>
		<wsa:To
			soapenv:mustUnderstand="true"
			xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
			xmlns:wsa="http://www.w3.org/2005/08/addressing"
			>http://localhost/cs-repository/xds-iti41</wsa:To>
		<wsa:MessageID
			soapenv:mustUnderstand="true"
			xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
			xmlns:wsa="http://www.w3.org/2005/08/addressing"
			>urn:uuid:A069CB1CFAC3BB37FF1418856634163</wsa:MessageID>
		<wsa:Action
			soapenv:mustUnderstand="true"
			xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
			xmlns:wsa="http://www.w3.org/2005/08/addressing"
			>urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action>
	</soap:Header>
	<soap:Body>
		<xdsb:ProvideAndRegisterDocumentSetRequest
			xmlns:xdsb="urn:ihe:iti:xds-b:2007">
			<lcm:SubmitObjectsRequest
				xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
				<rim:RegistryObjectList
					xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
					>
					<rim:ExtrinsicObject
						id="--DOC_OBJ_ID--"
						mimeType="--MIME_TYPE--"
						objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"
						><!--
						urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
						-->
						<rim:Slot name="creationTime">
							<rim:ValueList>
								<rim:Value>20061224</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Slot name="languageCode">
							<rim:ValueList>
								<rim:Value>en-us</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<!---->
						<rim:Slot name="serviceStartTime">
							<rim:ValueList>
								<rim:Value>200612230800</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Slot name="serviceStopTime">
							<rim:ValueList>
								<rim:Value>200612230900</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<!---->
						<rim:Slot name="sourcePatientId">
							<rim:ValueList>
								<rim:Value>--PATIENT_ID--^^^&amp;3.4.5&amp;ISO</rim:Value><!--89765a87b-->
							</rim:ValueList>
						</rim:Slot>
						<!---->
						<rim:Slot name="sourcePatientInfo">
							<rim:ValueList>
								<rim:Value>PID-3|pid1^^^&amp;1.2.3&amp;ISO</rim:Value>
								<rim:Value>PID-5|Doe^John^^^</rim:Value>
								<rim:Value>PID-7|19560527</rim:Value>
								<rim:Value>PID-8|M</rim:Value>
								<rim:Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<!---->
						<!---->
						<rim:Name>
							<rim:LocalizedString value="DocB"/>
						</rim:Name>
						<!---->
						<!---->
						<rim:Description/>
						<!---->
						<!---->
						<rim:Classification
							classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation=""
						    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
						    id="id_1"
						    >
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="authorPerson">
								<rim:ValueList>
									<rim:Value>^Smitty^Gerald^^^</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorInstitution">
								<rim:ValueList>
									<rim:Value>Cleveland Clinic</rim:Value>
									<rim:Value>Parma Community</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorRole">
								<rim:ValueList>
									<rim:Value>Attending</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorSpecialty">
								<rim:ValueList>
									<rim:Value>Orthopedic</rim:Value>
								</rim:ValueList>
							</rim:Slot>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation=""
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_2"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="authorPerson">
								<rim:ValueList>
									<rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorInstitution">
								<rim:ValueList>
									<rim:Value>Cleveland Clinic</rim:Value>
									<rim:Value>Berea Community</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorRole">
								<rim:ValueList>
									<rim:Value>Primary Surgon</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorSpecialty">
								<rim:ValueList>
									<rim:Value>Orthopedic</rim:Value>
								</rim:ValueList>
							</rim:Slot>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="History and Physical"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_3"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon classCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="History and Physical"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="1.3.6.1.4.1.21367.2006.7.102"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_4"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon confidentialityCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="Clinical-Staff"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="CDAR2/IHE 1.0"
						    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
						    id="id_5"
						    >
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon formatCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="CDAR2/IHE 1.0"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="Outpatient"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_6"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon healthcareFacilityTypeCodes 2</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="Outpatient"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="Dialysis"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_7"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon practiceSettingCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="Dialysis"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="T-D4909"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_8"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>SNM3</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="Kidney"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="T-62002"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_9"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>SNM3</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="Liver"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification
							classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983"
							classifiedObject="--DOC_OBJ_ID--"
							nodeRepresentation="34108-1"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_10"
							>
							<!--
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>LOINC</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="Outpatient Evaluation And Management"/>
							</rim:Name>
						</rim:Classification>
						<!---->
						<rim:ExternalIdentifier
							identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427"
							value="--PATIENT_ID--^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
							id="id_11"
							registryObject="--DOC_OBJ_ID--"
							><!--
							085099^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Name>
								<rim:LocalizedString value="XDSDocumentEntry.patientId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
						<rim:ExternalIdentifier
							identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
							value="--DOC_ENTRY_ID--"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
							id="id_12"
							registryObject="--DOC_OBJ_ID--"
							>
							<!--
							1.42.20141217093658.4
							urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
							-->
							<rim:Name>
								<rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
					</rim:ExtrinsicObject>
					<rim:RegistryPackage
						id="--SUBM_SET_OBJ_ID--"
						objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage"
						>
						<!--
						urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
						-->
						<rim:Slot name="submissionTime">
							<rim:ValueList>
								<rim:Value>20041225235050</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<!---->
						<rim:Name>
							<rim:LocalizedString value="Physical"/>
						</rim:Name>
						<!---->
						<!--
						<rim:Description>
							<rim:LocalizedString value="Annual physical"/>
						</rim:Description>
						-->
						<!---->
						<rim:Classification
							classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d"
							classifiedObject="--SUBM_SET_OBJ_ID--"
							nodeRepresentation=""
						    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_13"
							>
							<!--
							urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
							-->
							<rim:Slot name="authorPerson">
								<rim:ValueList>
									<rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorInstitution">
								<rim:ValueList>
									<rim:Value>Cleveland Clinic</rim:Value>
									<rim:Value>Berea Community</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorRole">
								<rim:ValueList>
									<rim:Value>Primary Surgon</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorSpecialty">
								<rim:ValueList>
									<rim:Value>Orthopedic</rim:Value>
								</rim:ValueList>
							</rim:Slot>
						</rim:Classification>
						<!---->
						<!---->
						<rim:Classification
							classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500"
							classifiedObject="--SUBM_SET_OBJ_ID--"
							nodeRepresentation="History and Physical"
						    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
							id="id_14"
							>
							<!--
							urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
							-->
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon contentTypeCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="History and Physical"/>
							</rim:Name>
						</rim:Classification>
						<!---->
						<rim:ExternalIdentifier
							identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
							value="--SUBM_SET_ID--"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
							id="id_15"
						    registryObject="--SUBM_SET_OBJ_ID--"
							>
							<!--
							1.42.20141217093658.5
							urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
							-->
							<rim:Name>
								<rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
						<!---->
						<rim:ExternalIdentifier
							identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
							value="1.3.6.1.4.1.21367.13.2250"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
							id="id_16"
						    registryObject="--SUBM_SET_OBJ_ID--"
							>
							<!--
							1.3.6.1.4.1.21367.13.2250
							urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
							-->
							<rim:Name>
								<rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
						<!---->
						<rim:ExternalIdentifier
							identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446"
							value="--PATIENT_ID--^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO"
							objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
						    id="id_17"
							registryObject="--SUBM_SET_OBJ_ID--"
							>
							<!--
							085099^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO
							urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
							-->
							<rim:Name>
								<rim:LocalizedString value="XDSSubmissionSet.patientId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
					</rim:RegistryPackage>
					<!---->
					<rim:Classification
						classifiedObject="--SUBM_SET_OBJ_ID--"
						classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
						id="urn:uuid:a06e0c8d-6887-48e7-bf27-9a194eb5f47d"
					    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
					/>
					<!--
					urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
					-->
					<!---->
					<rim:Association
						associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember"
						sourceObject="--SUBM_SET_OBJ_ID--"
						targetObject="--DOC_OBJ_ID--"
					    id="--ASSOC_ID--"
						objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association"
						>
						<!--
						urn:uuid:344a3e5b-57db-44b0-800e-96ba7ac4b649
						urn:uuid:ba6d7bc6-532c-4bd3-a132-ea8442d38dee
						-->
						<rim:Slot name="SubmissionSetStatus">
							<rim:ValueList>
								<rim:Value>Original</rim:Value>
							</rim:ValueList>
						</rim:Slot>
					</rim:Association>
					-->
				</rim:RegistryObjectList>
			</lcm:SubmitObjectsRequest>
			<!--xdsb:Document id="DOC_OBJ_ID">DOC_BIN_DATA</xdsb:Document-->
			<xdsb:Document id="--DOC_OBJ_ID--">
				<xop:Include
					xmlns:xop="http://www.w3.org/2004/08/xop/include"
					href="cid:--DOC_ATT_ID--"
				/>
			</xdsb:Document>
			<!--
			urn:uuid:27fa5463-61fe-4f45-9648-8be8db798eb0
			-->
		</xdsb:ProvideAndRegisterDocumentSetRequest>
	</soap:Body>
</soap:Envelope>